dompap-core/src/main/resources/nds-template2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="0"
                       xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-%--osb.sessionid--%">
                <wsse:Username>%--osb.username--%</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">%--osb.password--%</wsse:Password>
                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">%--osb.nonce--%</wsse:Nonce>
                <wsu:Created>%--zulutime--%</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
        <h:serviceContext schemaVersion="1.0" xmlns="http://servicecontext.ntpsoa.nordea.com/object"
                          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                          xmlns:h="http://servicecontext.ntpsoa.nordea.com/object">
            <userId>%--userId--%</userId>
            <technicalUserId>%--technicalUserId--%</technicalUserId>
            <sessionId>%--sessionId--%</sessionId>
            <requestId>%--requestId--%</requestId>
            <applicationId>%--applicationId--%</applicationId>
            <channelId>%--channelId--%</channelId>
            <clientType>%--clientType--%</clientType>
            <clientComponent>%--clientComponent--%</clientComponent>
            <clientComponentVersion>%--clientComponentVersion--%</clientComponentVersion>
            <clientAction>%--clientAction--%</clientAction>
            <clientView>%--clientView--%</clientView>
            <processInstance>%--processInstance--%</processInstance>
            <authMethod>%--authMethod--%</authMethod>
            <officeMode>%--officeMode--%</officeMode>
            <userLocation>%--userLocation--%</userLocation>
            <branch>%--branch--%</branch>
            <customer>%--customer--%</customer>
            <employee>%--employee--%</employee>
            <requestDomain>%--requestDomain--%</requestDomain>
            <messageTimeStamp>%--messageTimeStamp--%</messageTimeStamp>
            <auditCategory>%--auditCategory--%</auditCategory>
            <test>%--test--%</test>
            <testParams xsi:nil="true" />
            <accountingUnit>%--accountingUnit--%</accountingUnit>
        </h:serviceContext>
    </soapenv:Header>
    <soapenv:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <sendDocumentRequest xmlns="http://digitalsigning.ntp.nordea.com/digitalsigning/service/v2">
            <recipientList xmlns="">
                %--recipientList--%
            </recipientList>
            <content xmlns="">
                <documentReference>
                    <documentURI>%--documentURI--%</documentURI>
                    <documentTitle>%--documentTitle--%</documentTitle>
                    <documentFileType>%--documentFileType--%</documentFileType>
                </documentReference>
                    %--signing--%
                <attachmentList>
                    %--attachments--%
                </attachmentList>
            </content>
            <callbackURL xmlns="">%--callbackURL--%</callbackURL>
            <sender xmlns="">%--sender--%</sender>
            <realTimeDelivery xmlns="">%--realTimeDelivery--%</realTimeDelivery>
        </sendDocumentRequest>
    </soapenv:Body>
</soapenv:Envelope>